Revit 2026 API

# ApplicationNewCurveLoopsProfile Method

---

Creates a new CurveLoopsProfile object.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveLoopsProfile NewCurveLoopsProfile(
	CurveArrArray curveLoops
)
```
```vb
Public Function NewCurveLoopsProfile (
	curveLoops As CurveArrArray
) As CurveLoopsProfile
```
```cpp
public:
CurveLoopsProfile^ NewCurveLoopsProfile(
	CurveArrArray^ curveLoops
)
```
```fsharp
member NewCurveLoopsProfile :
        curveLoops : CurveArrArray -> CurveLoopsProfile
```

#### Parameters

curveLoops CurveArrArray
    The curve loops of the Profile.

#### Return Value

CurveLoopsProfileThe new CurveLoopsProfile object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the argument is . |

#### Reference

Application Class

Autodesk.Revit.Creation Namespace